// --------------------- // بسم الله الرحمن الرحيم // --------------------- //
console.clear();

require('./src/libs/global')
require('./src/app')

console.info(
    // colors.bg.Green,
    colors.fg.Crimson,
    `
    ███████╗██╗░░██╗██████╗░██████╗░░█████╗░
    ██╔════╝╚██╗██╔╝██╔══██╗██╔══██╗██╔══██╗
    █████╗░░░╚███╔╝░██████╔╝██████╔╝██║░░██║
    ██╔══╝░░░██╔██╗░██╔═══╝░██╔══██╗██║░░██║
    ██║░░░░░██╔╝╚██╗██║░░░░░██║░░██║╚█████╔╝
    ╚═╝░░░░░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░╚═╝░╚════╝░
    `,
colors.Reset)


require('./src/libs/mongodb').DBConnection()